app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 1) LIMIT 1
---
  def show
    @booking = Booking.find(params[:id])

SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 1) LIMIT 1
---
  def edit
    @booking = Booking.find(params[:id])

SELECT "hotels".* FROM "hotels" WHERE ("hotels"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 5) LIMIT 1
INSERT INTO "bookings" ("checkoutDate", "created_at", "smoking", "updated_at", "creditCardName", "checkinDate", "hotel_id", "user_id", "creditCardNumber", "beds", "creditCardType", "creditCardExpiryMonth", "creditCardExpiryYear") VALUES ('2011-02-25', '2011-02-23 12:39:48.892518', 'f', '2011-02-23 12:39:48.892518', 'Romaric Pascal', '2011-02-24', 4, 18, '0000000000000000', 1, 'VISA', 4, 2012)
---
  def create
    params.delete('action')
    params.delete('controller')
    params[:hotel] = Hotel.find(params[:hotel][:id])
    params[:user] = User.find(params[:user][:id])
    @booking = Booking.new(params[:booking] || params)


    respond_to do |format|
      if @booking.save

SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 1) LIMIT 1
UPDATE "bookings" SET "checkoutDate" = '2010-02-10', "creditCardName" = 'name', "checkinDate" = '2010-02-01', "updated_at" = '2011-02-09 14:34:38.922453', "hotel_id" = 1, "crediCardType" = 'VISA', "creditCardExpiryYear" = 2012, "creditCardNumber" = '0000000000000000', "user_id" = 1, "creditCardExpiryMonth" = 12 WHERE ("bookings"."id" = 1)
---
  def update
    @booking = Booking.find(params[:id])

    respond_to do |format|
      if @booking.update_attributes(params[:booking])

SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 2) LIMIT 1
DELETE FROM "bookings" WHERE ("bookings"."id" = 2)
---
  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy

SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 5) LIMIT 1
---
  def find_by_user

    @bookings = Booking.where('user_id=?',params[:id])