app/controllers/hotels_controller.rb

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT "hotels".* FROM "hotels" WHERE ("hotels"."id" = 1) LIMIT 1

  def edit
    @hotel = Hotel.find(params[:id])
---
SELECT "hotels".* FROM "hotels" WHERE ("hotels"."id" = 2) LIMIT 1

  def create
    @hotel = Hotel.new(params[:hotel])

    respond_to do |format|
      if @hotel.save
---
INSERT INTO "hotels" ("created_at", "city", "state", "start", "zip", "name", "address", "price", "updated_at", "country") VALUES ('2011-02-09 14:36:16.951192', 'First City', 'First State', 10, 'First Zip', 'Hotel 1', 'First Address', 25.0, '2011-02-09 14:36:16.951192', 'First Country')

  def update
    @hotel = Hotel.find(params[:id])

    respond_to do |format|
      if @hotel.update_attributes(params[:hotel])
---
SELECT "hotels".* FROM "hotels" WHERE ("hotels"."id" = 2) LIMIT 1
UPDATE "hotels" SET "start" = 12, "updated_at" = '2011-02-02 09:54:13.408655' WHERE ("hotels"."id" = 2)

  def search
    size = params['size'].to_i || 5
    page = params['page'].to_i || 0


    logger.debug "Size of the list:  #{size}"
    logger.debug "Page number: #{page}"
    logger.debug "Offset: #{page*size}"
    logger.debug "Query: #{params['q']}"


    if(params['q']) then
      @hotel = Hotel.where("name LIKE ?",'%'+params['q']+'%').limit(size).offset(page*size)
    else
      @hotel = Hotel.limit(size).offset(page*size)
---
SELECT "hotels".* FROM "hotels" WHERE (name LIKE '%'1'%') LIMIT 5 OFFSET 0
SELECT "hotels".* FROM "hotels" LIMIT 5 OFFSET 0