app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    logger.debug params.inspect
    params.delete('action')
    params.delete('controller')
    logger.debug params[:user]
    @user = User.new(params[:user] || params)

    logger.debug ActiveRecord::Base.include_root_in_json

    if @user.save
---
INSERT INTO "users" ("email", "password", "updated_at", "fullname", "created_at", "username") VALUES ('romaric@pascal.net', 'romaric', '2011-01-19 17:31:39.728978', 'romaric', '2011-01-19 17:31:39.728978', 'rpascal')

  def update
    @user = User.find(params[:id])
    params.delete('action')
    params.delete('controller')
    respond_to do |format|
      if @user.update_attributes(params[:user] || params)
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 5) LIMIT 1
UPDATE "users" SET "created_at" = '2011-01-19 17:27:55.000000', "updated_at" = '2011-01-19 17:27:55.000000' WHERE ("users"."id" = 5)

  def check
    logger.debug 'Sent username: '+params.inspect
    @user = User.where('username = ?', params['username']).first;
---
SELECT "users".* FROM "users" WHERE (username = NULL) LIMIT 1